{
    "title": "Why Republicans Finally Moved Against Steve King",
    "author": "Russell Berman",
    "source": "Theatlantic.com",
    "summary": "Elections have consequences, and the Iowa conservative’s sudden vulnerability back home gave House GOP leaders the permission they needed to act against his latest racist comments.",
    "datePublished": "January 19, 2019",
    "dateScraped": "January 19, 2019",
    "text": "King initially beat a hasty retreat, insisting during a speech on the House floor that he was neither a white nationalist nor a white supremacist. “I reject those labels and the evil ideology they define,” he said.It was too late. This time, apparently, King had gone too far.Mitt Romney, the one-time party standard-bearer who is now a freshman GOP senator, called on him to resign. Senate Majority Leader Mitch McConnell effectively agreed, suggesting he “find a new line of work.” And on Monday evening, the newly minted House Republican leader, Kevin McCarthy, directed his members to block King from continuing to serve on either the Judiciary or Agriculture Committees, where he had been one of the party’s most senior members.With that move, McCarthy had done something that neither of the past two Republican speakers, John Boehner and Paul Ryan, had managed to do: taken substantive action to strip King of legislative authority.“I am a brand-new leader,” McCarthy explained on Tuesday when a reporter asked him why he had moved against King now and not before. “I listened to what Steve said. I brought Steve in and met with him. I also did research on what Steve has said in the past. I believe this party is the party of Lincoln.”“There is no room for white supremacy,” McCarthy continued. “That’s why I took a strong action.”What McCarthy neglected to mention is that the political circumstances have also changed, both for Republicans as a party and for King personally. In the past, House GOP leaders like Boehner and Ryan have dispensed no more than rhetorical rebukes of King while allowing him to keep his perch on key committees and waiting for each successive controversy to fade with the churn of the news cycle. But with Democrats now in charge in the House, McCarthy could not stop Democrats from bringing a vote on resolutions either disapproving of King’s comments or formally censuring him. The House on Tuesday afternoon voted, 424–1, on a resolution “rejecting white nationalism and white supremacy.” King cast a yes vote on the measure, which cited but did not specifically condemn him. (The one “no” vote came from Democratic Representative Bobby Rush of Illinois, who was protesting the resolution’s toothlessness.)“It was important for Republicans to stand up and say this is unacceptable, because if the Democrats had done that for them, that would have sent a terrible message to voters, not just in King’s congressional district but voters throughout the country,” says Doug Heye, a former spokesman for the Republican National Committee who also served as a top aide to then–House Majority Leader Eric Cantor.Yet what might have been an even bigger factor in McCarthy’s decision was King’s own suddenly precarious political standing back in Iowa. For more than a decade, King had been, well, a kingmaker in his home state: He regularly won reelection to the House by more than 20 points, and he was one of the most sought-after endorsements for conservative presidential contenders campaigning ahead of the first-in-the-nation caucuses. (In 2016, King’s nod went to Senator Ted Cruz, though the congressman eventually became a close ally of Trump’s.)",
    "stance": "L",
    "url": "https://www.theatlantic.com/politics/archive/2019/01/why-republicans-finally-moved-against-steve-king/580489/",
    "imageUrl": "https://cdn.theatlantic.com/assets/media/img/mt/2019/01/AP_19010780682216/facebook.jpg?1547577141"
}